Revit 2027 API
RebarSpliceTypeUtils Methods
The RebarSpliceTypeUtils type exposes the following members.
Methods
Name | Description
CreateRebarSpliceType |  Creates a Rebar Splice Type element.
GetAllRebarSpliceTypes |  Gets all the Rebar Splice Types elements from the document.
GetLapLengthMultiplier |  Gets the lap length multiplier value.
GetShiftOption |  Identifies the way bars are shifted in the splice relation.
GetStaggerLengthMultiplier |  Gets the stagger multiplier value.
SetLapLengthMultiplier |  Sets the lap length multiplier value.
SetShiftOption |  Sets the way bars are shifted in the splice relation.
SetStaggerLengthMultiplier |  Sets the lap length multiplier value.
Top
See Also
Reference
RebarSpliceTypeUtils Class
Autodesk.Revit.DB.Structure Namespace